In [1]:
import pandas as pd

In [3]:
dataset={
    'Student':['kevin','avinas','keyur','harsh'],
    'Addmission':[2003,2024,2022,2023]
}
demo=pd.DataFrame(dataset)
print(demo)

  Student  Addmission
0   kevin        2003
1  avinas        2024
2   keyur        2022
3   harsh        2023

In [4]:
print(pd.__version__)

1.4.2

In [8]:
a=[20,30,40,50]
demo1=pd.Series(a)
print(demo1)

0    20
1    30
2    40
3    50
dtype: int64

In [10]:
demo2=pd.Series(a,index=["m1","m2","m3","m4"])
print(demo2)

m1    20
m2    30
m3    40
m4    50
dtype: int64

In [14]:
print(demo2
      ["m1"])

20

In [18]:
marks={"kevin":299,"paras":100,"harsh":150}
demo3=pd.Series(marks)
print(demo3)

kevin    299
paras    100
harsh    150
dtype: int64

In [17]:
print(demo3["kevin"])

299

In [21]:
demo3=pd.Series(marks,index={"kevin","harsh"})
print(demo3)

kevin    299
harsh    150
dtype: int64

In [22]:
data={"Product":["chocolate","puff","wafers"],
     "Price":[150,20,25]}

dataf=pd.DataFrame(data)
print(dataf)

     Product  Price
0  chocolate    150
1       puff     20
2     wafers     25

In [26]:
print(dataf.loc[2])

Product    wafers
Price          25
Name: 2, dtype: object

In [41]:
stmark=pd.read_csv('demo.csv')
print(stmark)

   roll no    Name   Total mark  Obtain mark
0        1    Kevin         500        499.0
1        2  Avinash         500        380.0
2        3    Harsh         500        102.0
3        4     Ansh         500        399.0
4        5    Parsh         500        450.0
5        6    Kevin         500        499.0
6        7  Avinash         500          NaN
7        8    Harsh         500        102.0
8        9     Ansh         500        399.0
9       10    Parsh         500          NaN

In [33]:
print(pd.options.display.max_rows)

60

In [36]:
print(stmark.tail())#get last five records

   roll no    Name   Total mark  Obtain mark
5        6    Kevin         500          499
6        7  Avinash         500          380
7        8    Harsh         500          102
8        9     Ansh         500          399
9       10    Parsh         500          450

In [37]:
print(stmark.head())#get first 5 records

   roll no    Name   Total mark  Obtain mark
0        1    Kevin         500          499
1        2  Avinash         500          380
2        3    Harsh         500          102
3        4     Ansh         500          399
4        5    Parsh         500          450

In [38]:
print(stmark.info())#info about csv file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   roll no      10 non-null     int64
 1   Name         10 non-null     object
 2   Total mark   10 non-null     int64
 3   Obtain mark  10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes
None

In [42]:
new_stud=stmark.dropna()#delete row where column have null value in any field 
print(new_stud)

   roll no    Name   Total mark  Obtain mark
0        1    Kevin         500        499.0
1        2  Avinash         500        380.0
2        3    Harsh         500        102.0
3        4     Ansh         500        399.0
4        5    Parsh         500        450.0
5        6    Kevin         500        499.0
7        8    Harsh         500        102.0
8        9     Ansh         500        399.0

In [48]:
fill_stud=stmark.fillna(111)
print(fill_stud)

   roll no    Name   Total mark  Obtain mark
0        1    Kevin         500        499.0
1        2  Avinash         500        380.0
2        3    Harsh         500        102.0
3        4     Ansh         500        399.0
4        5    Parsh         500        450.0
5        6    Kevin         500        499.0
6        7  Avinash         500        111.0
7        8    Harsh         500        102.0
8        9     Ansh         500        399.0
9       10    Parsh         500        111.0

In [49]:
stmark["Obtain mark"].fillna(2000)

0     499.0
1     380.0
2     102.0
3     399.0
4     450.0
5     499.0
6    2000.0
7     102.0
8     399.0
9    2000.0
Name: Obtain mark, dtype: float64

In [58]:
mean=stmark["Obtain mark"].mean()
print("Mean is :",mean)

Mean is : 353.75

In [59]:
median=stmark["Obtain mark"].median()
print("Median is :",median)

Median is : 399.0

In [60]:
mode=stmark["Obtain mark"].mode()
print("Mode is :",mode)

Mode is : 0    102.0
1    399.0
2    499.0
Name: Obtain mark, dtype: float64

In [61]:
stmark.columns #get colmn name in csv file

Index(['roll no', 'Name ', 'Total mark', 'Obtain mark'], dtype='object')

In [62]:
print(stmark.loc[2:5])

   roll no  Name   Total mark  Obtain mark
2        3  Harsh         500        102.0
3        4   Ansh         500        399.0
4        5  Parsh         500        450.0
5        6  Kevin         500        499.0

In [68]:
stmark.sort_values(["Obtain mark"],ascending=0)# for ascending

   roll no    Name   Total mark  Obtain mark
0        1    Kevin         500        499.0
5        6    Kevin         500        499.0
4        5    Parsh         500        450.0
3        4     Ansh         500        399.0
8        9     Ansh         500        399.0
1        2  Avinash         500        380.0
2        3    Harsh         500        102.0
7        8    Harsh         500        102.0
6        7  Avinash         500          NaN
9       10    Parsh         500          NaN

In [73]:
stmark.sort_values(["Obtain mark"],ascending=1)#for desending

   roll no    Name   Total mark  Obtain mark
2        3    Harsh         500        102.0
7        8    Harsh         500        102.0
1        2  Avinash         500        380.0
3        4     Ansh         500        399.0
8        9     Ansh         500        399.0
4        5    Parsh         500        450.0
0        1    Kevin         500        499.0
5        6    Kevin         500        499.0
6        7  Avinash         500          NaN
9       10    Parsh         500          NaN

In [80]:
stmark['Percentage']=(stmark['Obtain mark']/stmark["Total mark"])*100
stmark.head(5)

   roll no    Name   Total mark  Obtain mark  Percentage
0        1    Kevin         500        499.0        99.8
1        2  Avinash         500        380.0        76.0
2        3    Harsh         500        102.0        20.4
3        4     Ansh         500        399.0        79.8
4        5    Parsh         500        450.0        90.0